Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON KO>EN She's No Angel.tmx
Source language: ko_kr
Languages: en

source: 깜박 잠들었나?
en: did I fall asleep?

source: 네가 불쌍해서 이런 말까지는 안 하려고 했는데.
en: I didn't wanna say this because I felt sorry for you.

source: 방해만 될 뿐이야.
en: just getting in her way.

source: 나무를 다 뽑아 버리든가 해.
en: pluck out and get rid of all the trees.

source: 바다에서 자전거도 타고,
en: cycling at the sea and

source: 사사 선생님이 식물도 돌보신 건가요?
en: was it miss sasha who looked after them?

source: 제가 본 커피는 짊어진 게 많아 보였거든요.
en: the coffee I saw looked like he had a lot to carry on his own.

source: 그리고?
en: and?

source: 거기 누구야!!
en: who’s there?!

source: 부탁드리고 싶은 것이 있어, 실례를 무릅쓰고 찾아왔습니다.
en: be it rude of me, I’m here to make a request of you.

source: 괜찮아 ―
en: it’s okay...

source: 부모님이 어떻게 만나 결혼하셨는지 듣고 싶어요….
en: so I wanted to ask how you and mother met and ended up getting married…

source: 딴 길로 새지 말고 집으로 곧장 오라고 했을 텐데.
en: I’m sure I told you to come straight home and no where else.

source: 짜증으로 떨리는 귓구멍
en: ears trembling due to annoyance

source: 뽑아주마….
en: pluck out your teeth.

source: 이게 무슨 개판이야-
en: what a mess…

source: 사람이 왜 이리 없어?
en: why aren’t there any people?

source: 아빠가 허락한 첫 번째 친구잖니?
en: this is the first friend I’m allowing you to have.

source: 지금 이러고 있을 때가 아닌데….
en: I don’t have time for this...

source: 할아버지 편찮으셔서 집안 분위기도 어수선한데, 이 이상 걱정거릴 늘려야겠느냐고.
en: everyone’s uneasy because grandfather is ill. must you really make me more worried?

source: 사람을 부르면 몰래 들어온 걸 들킬 텐데.
en: if I call for help, people will find out I snuck in.

source: 손을 내밀어 봤자겠군.
en: I guess I could’ve held out my hand.

source: 부모님은요…?
en: what about your parents?

source: 왜 이렇게 오래 걸려??
en: what’s taking them so long?

source: 우리 아가씨는 정말 늠름하시다니까!
en: my lady, you are quite plucky!

source: 그러다 보니 자연스럽게 관심도 멀어져 갔어.
en: because of that, my interest in her naturally waned.

source: 사사 선생님은 지금 바쁘십니다.
en: miss sasha is busy right now.

source: 어머, 신부님 오늘 끝나고 어디 가세요?
en: oh my, are you going out somewhere later today, father?

source: 이거….
en: this…

source: 믿고 기다리면 평판도 오르겠죠.
en: trust and wait, and your reputation will improve, too.

source: 그럼~
en: of course.

source: 아- 그게 아니라요-!
en: oh... it’s not like that!

source: 진정하세요!
en: please calm down!

source: 또래 여자친구 말이야.
en: a girl of my age.

source: 엄마는 뭘 좋아하지?
en: what does mother like?

source: 이런, 슬리퍼를 신고와 버렸네.
en: oh, I came all the way here in slippers.

source: 두 개 주시면 안 돼용?
en: can’t you give me two?

source: 그래야 아가씨가 그곳으로 돌아가지 못할 테니까요.
en: that way, you won’t be able to go back there.

source: 그분들께 거절당하면― 흠, 단델리온이 소개해준 종교집단도 있고.
en: if they reject me… hmm, there’s also this religious group daniel introduced.

source: 이렇게 잔뜩 사주다니 신부님, 부자구나~?
en: father, you must be rich to buy me all this food!

source: 절대 반격할 생각 마시고 무조건 피하는 거예요.
en: don't try to fight back and avoid them at all costs.

source: 이 ㅅㄲ 어른을 패네 ㅋㅋ
en: this punk’s beating up an adult now, lol!

source: 말도 안 돼!!
en: no way!!

source: 진짜 신랑 신부 맞아?
en: are you sure they’re bride and groom?

source: 바로 풀어 드리지요―
en: I’ll give you the passcode.

source: 네에-
en: sure.

source: 차나 한 잔 마시고 가.
en: have some tea before you go.

source: 아들 같은 네 입에서 그런 질문이 나오다니…
en: to hear such a question coming from someone you treat like a son’s mouth…

source: 희생?
en: sacrifice?

source: 결혼 준비 때문에 오늘부로 그만둔다면서요.
en: I was told you’re quitting starting today to prepare for the wedding.

source: 커피.
en: coffee.

source: 안 괜찮을 건 또 뭐람?
en: why wouldn’t I be?

source: 덕분에 다 끝난 것 같아.
en: I think it's all over thanks to you.

source: 바보-
en: they’re idiots.

source: 앗, 신부님!
en: ah, father!

source: 이딴 시시한 가족 놀이에 투자한 시간이 아깝군.
en: I’ve wasted time playing along with this foolish game called “family.”

source: 미리 불안해 하지 말자.
en: I need to calm down first.

source: 넌 어릴 때부터 나를 사랑해야 하는 존재로 학습된 것 뿐이야.
en: you were just taught to love me ever since you were young.

source: 금귤 명령으로 나와 어울린다는 게 사실인가요?
en: did Gyul Geum tell you to hang out with me?

source: 난 자네를 신뢰하니까 말이야.
en: I trust you.

source: 보지도 않네.
en: he’s not even looking.

source: 할 수 있어!
en: I can do it!

source: 이유 없이 종교인을 건드릴 분도 아니고….
en: he’s not the type to mess with a religious person for no reason.

source: 신부님께 결혼식 주례를 부탁드리지요.
en: I’ll leave the officiating to you.

source: 아가씨…?
en: miss…?

source: 학생증이랑 교복 더 필요하면 얘기해.
en: if you need more student ids and uniforms, let me know.

source: 주말 아침부터 누구지?
en: who could it be on a weekend?

source: 왜 그런 곳에 있어?
en: what are you doing up there?

source: 늘 똑같지― 오늘 여기서 자고―
en: the same as usual. I’ll sleep here tonight...

source: 단도직입적으로 이야기하죠.
en: let me get straight to the point.

source: 무슨 일인지 모르겠지만, 빨리 화해해요~?
en: whatever it is, hurry and make up, okay?

source: 그러기 위해서는 정보가 더 필요하겠어.
en: but I’d need more information.

source: 안색이 안 좋아.
en: you look a little pale.

source: 아가씨를 이리저리 부추기시더군요.
en: you’ve been pushing him around.

source: 어쨌든 회장님 책상 위에 있던 것들이니까.
en: these things were on top of the president’s desk, after all.

source: 생각을 좀 하느라고….
en: I was just thinking…

source: 조금 갑작스럽지만 ~~♡
en: although it’s a bit sudden,

source: 좋아요!
en: alright!

source: 몰라아―
en: I said I don’t know...

source: 우와….
en: woah...

source: 신발.
en: shoes.

source: 그러니 마지막으로 물어볼게.
en: so, I’m asking you one last time.

source: 한편으로는 네 그런 감수성을 존중하기도 한단다.
en: on the other hand, I respect your sensitivity.

source: 아, 그러니까.
en: I mean… you know,

source: 수줍어 말고 편히 합석해요.
en: don’t be shy and take a seat.

source: 내가 해줄 수 있을 때…
en: while I still can...

source: 오해예요….
en: you’ve misunderstood…

source: 낑깡, 저 자식은 어릴 때부터 늙은 여우 같았어.
en: gyul geum... he’s been like an old fox ever since we were little.

source: 그냥, 좀.
en: it’s just because.

source: 진심으로요.
en: I mean it.

source: 평소라면 나한테 시비를 걸거나 비아냥 거렸을 텐데.
en: normally, he would be arguing with or being sarcastic to me.

source: 언제부터 보고 있었던 거지…?
en: how long has he been watching...?

source: "친구"로서 말이에요.
en: but as friends.

source: 앗,{j}내 안경.
en: ah, my glasses.{j}

source: 신부님, 이쪽!
en: father, this way!

source: 여기는~
en: and here...

source: 저야말로 직접 소개해 주신다니 영광이에요!
en: no, it’s my honor to have you be my guide!

source: 나만 아는 비밀 장소인데.
en: there’s this secret place that I go to sometimes.

source: 나보다도 더 나를 잘 아는군.
en: you know me better than I do.

source: 비었…
en: there aren’t...

source: 아무튼 그런 줄 알아.
en: just take my word for it.

source: 놀랍지도 않아.
en: I’m not even surprised.

source: 끄 - 응.
en: aaargh.

source: 아버지 명령이잖아.
en: it’s father’s orders.

source: 이 정도 설명이면 됐지?
en: is this enough?

source: 야, 튀어.
en: hey, let’s take off.

source: 말 나온 김에 하나만 더 물어볼게요.
en: speaking of which, I want to ask you one more question.

source: 아이구 - 미안해라.
en: goodness, I’m sorry.

source: 소식이 늦어서 죄송해요~
en: I’m late sharing the news, sorry!

source: 아가씨랑 무슨 일 있었어요?
en: did something happen between you and miss sasha?

source: 그, 그건….
en: th-that’s...

source: 넌 입도 싸고 행동도 싸니까 여기저기 소문 냈겠지?
en: you talk crap and your manners are crap, so you must have spread the rumors.

source: 사사!!!
en: sasha!!!

source: 뭐야, 뭐야― 엄마 오랜만에 왔는데 왜 또 싸워.
en: hey now, it’s been a long time since your mom’s here, so why are you fighting?

source: 꼭 어린 시절로 돌아간 기분이군.
en: it’s like we returned to our younger days...

source: 그럼 왜!?
en: then why?!

source: 만약 지금, 이 순간에도 그녀가 학대를 당하고 있다면?
en: but what if she’s being abused right at this very moment?

source: 그래도 혹시 모르잖아요!
en: but you never know!

source: 다 부질없어…
en: everything you’ve done so far...

source: 쓰레기?
en: scumbags?

source: 원래 처음은 서투른 법이지요.
en: it’s always awkward at the beginning.

source: 감동적인 순간을 보고 싶어서!!
en: I wanted to witness this touching moment!

source: 넌 집안의 제약회사에 잠입해줘.
en: so you sneak into the pharmaceutical company.

source: 너 때문이 아니야.
en: it’s not your fault.

source: 그저 아이들을 믿고 기다려주는 것 뿐이지요.
en: I just trust the children and wait for them, that’s all.

source: 이렇게 늦은 시간에 웬일이실까―?
en: what are you doing up so late?

source: 건강검진은?
en: what about a health checkup?

source: 같이 밥 먹어요!!
en: let’s eat together!

source: 그리 길게 이야기한 것도 아니잖아요!
en: but we haven’t even been talking for a long time!

source: 흐음 -
en: hmmm...

source: 사 ―
en: sa-

source: 같이 가요!
en: wait for me!

source: 아픈 모습을 보여주기 싫었나?
en: did she not want me to find out?

source: 그러고 보니 엄마는 어떤 사람이었더라?
en: now that I think about it, what was mother like?

source: 전혀요!
en: not at all!

source: 쟤가!!!
en: his!!

source: 구마를… 해볼까 하고.
en: I just... thought I’d perform exorcism.

source: 만나 봬 반가웠습니다.
en: it was nice to meet you.

source: 그래서 이 자리는 뭐지?
en: so, what is this meeting about?

source: 저러면 고장 나잖아요―
en: you’ve broken it.

source: 빨리 끊어~!!
en: hang up already!

source: 바쁘신 와중에 연회에 참석해주셔서 감사합니다.
en: thank you for attending the banquet amidst your busy schedules.

source: 평소 내가 선호하는 스타일 알잖나.
en: you know what style I prefer.

source: 이쪽 수풀의 작은 개구멍으로….
en: through a hole in this bush...

source: 그래요… 나는 그렇다 치고.
en: okay... I’ll think of it that way.

source: 이제부터 넌 내 자식이 아니다.
en: from now on, you are not my son.

source: 그전에 무슨 일 생기면 시간 가리지 말고 언제든 절 부르세요.
en: in the mean time, call me anytime if anything happens.

source: 쥐ㅅㄲ 한 마리라도 숨어버리면 자네가 책임질 텐가?
en: can I hold you responsible if even a single rat hides around here?

source: 희망을 마셔요!!
en: drink hope!

source: 저 자식은 또 왜이리 신났어?
en: what’s he so excited about this time?

source: 어르신이 허락한 사람하고만 대화를 할 수 있는 사모님이 가엾어서….
en: I feel sorry for madam since she can only talk to people who her husband allows.

source: 어차피 곧 조직원이 찾으러 올 테니.
en: one of father’s lackeys will come looking for me anyway.

source: 어디 계세요-!!!
en: where are you?!

source: 본인은 어디 가고?
en: where did he go?

source: 우리 아버지를 공략해 봐.
en: that you’re teaching me to become a better person.

source: 들어오시지요.
en: please come in.

source: 불미스러운 일이 일어났다고 하던데요?
en: I heard something unpleasant happened.

source: 싸움도 못 하면서 왜 끼어들어요?
en: why did you get involved if you can’t even fight?

source: 으윽-
en: ugh...

source: 내가 아는 엄마는 누구보다도 유쾌한 분이신데.
en: the mother I knew was the most pleasant person.

source: 신부로서 그냥 지나칠 수 없달까요…?!
en: what I meant to say was... as a priest, I think I should check it out...?!

source: 뭘?
en: what?

source: 지금 무슨 말씀을 하시는 건가요?
en: what are you talking about?

source: 삐딱하기보다는 세상을 정확히 꿰는 거지.
en: it’s not that I’m twisted, it’s that I know just how the world works.

source: 그래!
en: aha,

source: 그런 걸 바라고 한 일이 아니니까.
en: that’s not why I jumped in.

source: 너처럼 용감해지고 싶어….
en: ...be brave like you...

source: 변명은 필요 없어.
en: I don’t need your excuses.

source: 또 시작이군….
en: it’s starting again…

source: 금귤 도련님께서 요즘 많이 예민해 보이십니다.
en: mr. gyul geum appears pretty sensitive these days.

source: 안녕히 가세요.
en: goodbye.

source: 이번엔 뭐가 또 불만이세요?
en: what are you dissatisfied with this time?

source: 이렇게 만났으니 들어왔다가~
en: since you’re here, you may as well come inside.

source: 여유가 생길 때까지 부탁 좀 하겠네.
en: I'll ask you a favor until I can afford it.

source: 학교생활이나, 귤 선생님이나, 아르바이트 같은 거.
en: your school life, about mr. geum, your job, things like that.

source: 그럼요.
en: of course.

source: “왜 이렇게까지 날 도와주는 거야?”
en: “why are you helping me so much?”

source: 자기 감정 하나 컨트롤 못하고…
en: why can’t I control a single emotion...?

source: 이상하다.
en: that’s odd.

source: 엄마.
en: mom...

source: “아, 이거였구나.”
en: “ah, this is it.”

source: 그렇게 생각을… 했었지.
en: that's what I think... I did.

source: 풋.
en: pfft.

source: 이 일이 끝나면 너에게 부족함 없는 보상을 할게.
en: I’ll compensate you enough when this is all over.

source: 가지 말아요.
en: please don’t.

source: 기다리세요―!!
en: wait!!!

source: 어머니.
en: mother.

source: 견학을 계속 해보실까요?
en: shall we continue our tour?

source: 익숙한 목소리가 들리던데요.
en: I heard a familiar voice.

source: 놔!!
en: let go!

source: 이런 건 그냥 도장 깨기 같은 거잖아.
en: it was just a dare thing.

source: 어르신은 훌륭한 분이시니까요!
en: you are a wonderful person, sir!

source: 진정하세요, 아가씨.
en: please calm down, miss.

source: 글쎄요, 혼자서는….
en: I don’t know. not alone...

source: 아무튼 결론은-!
en: anyway, my point is!

source: 이 문제는 너와 별개니까 깊이 관여하지 않아도 돼.
en: you don’t have to get too involved since this problem has nothing to do with you.

source: 회장실에서 대기하라는 명령을 받았는데요.
en: I was told to wait in the president’s office.

source: 이게 최근이네!
en: this is a recent one!

source: “그는 천사야.”
en: “he’s an angel.”

source: 잡았다!!
en: I got you!

source: 결혼 전이라 스트레스를 많이 받으셨나 보군요.
en: I see you’re very stressed with the wedding coming up.

source: 얘기를 다 들어버렸으니 돌이킬 수 없겠구나.
en: but since you overheard, there’s no going back now.

source: 아얏!
en: ouch!

source: X 같은 놈들.
en: ...are like sh*tbags to me.

source: 징그러운 놈.
en: he’s so clingy.

source: 오늘은 이만 돌아가는 게 좋겠다.
en: I think it’s best you leave now.

source: 웬일로 응석을 다부리고.
en: why are you acting up?

source: 네가 도둑맞은 물건이야.
en: it’s your stolen belongings.

source: 내가 무슨 말을 해도 소용없겠지만.
en: not that my saying anything would make a difference.

source: 게다가 신부(사사)는 잠깐 동선만 맞추고 다른 곳으로 가버렸잖아,
en: besides, the bride (sasha) just came in for a while before going somewhere else,

source: 엄마는 건강 때문에 더 이상 아이를 낳을 수 없는 상태거든.
en: my mom can't have any more children because of her health.

source: 저기다.
en: it’s coming from there.

source: 그러네…?
en: you’re right...

source: 사사… 무슨 이야기를 하려는 걸까…?
en: sasha... what is it you have to tell me?

source: 진심이세요?
en: are you serious?

source: 제정신이 아니야.
en: he’s crazy.

source: 주여….
en: lord…

source: 총장님만의 지도 비법이 있으신가요?
en: do you have any special tips for us?
